import { Shield, ArrowLeft } from "lucide-react";
import { Button } from "@/components/ui/button";
import { Link } from "react-router-dom";

const PrivacyPolicy = () => {
  return (
    <div className="min-h-screen dsk-gradient flex flex-col">
      <header className="green-header pt-3 pb-2 px-4 rounded-b-lg shadow-md">
        <h1 className="text-2xl font-semibold text-center tracking-tight mb-1">
          Политика за поверителност
        </h1>
      </header>

      <main className="flex-1 px-4 pb-16 pt-6">
        <div className="max-w-4xl mx-auto">
          <Link to="/">
            <Button variant="outline" className="mb-4 gap-2">
              <ArrowLeft className="w-4 h-4" />
              <span>Обратно към сайта</span>
            </Button>
          </Link>

          <div className="bg-white rounded-lg shadow p-6 mb-8">
            <div className="flex items-center gap-2 mb-4">
              <Shield className="h-6 w-6 text-primary" />
              <h2 className="text-xl font-medium">
                ПРАВИЛА ЗА ЗАЩИТА НА ЛИЧНИТЕ ДАННИ{" "}
              </h2>
            </div>

            <div className="space-y-4 text-muted-foreground pl-4">
              <p>
                MoyataPensia.bg, в качеството си на администратор и обработващ
                лични данни, събира, обработва и използва лични данни,
                предоставени от лице, ползващо услугите на сайта
                https://moyatapensia.bg/ само с негово изрично съгласие или
                когато има законово изискване за това. Личните данни, които се
                събират, обработват и използват, са в обема, необходими за
                предоставянето на услуги от сайта https://moyatapensia.bg/ и се
                предоставят доброволно от лицето за такива цели. С ползването на
                сайта, лицето дава съгласието си за обработването на
                необходимите за предоставяне на услугите, лични данни.
              </p>

              <p>
                Сайтът предоставя услуга чрез пенсионен калкулатор, за която
                събира, обработва и използва лични данни единствено за следните
                цели:
              </p>

              <ul className="space-y-2 pl-5 list-disc">
                <li>
                  Изчисляване на дата, на която лицето навършва възраст за
                  пенсиониране;
                </li>
                <li>
                  Изчисляване не наличие/липса на осигурителен стаж за пенсия от
                  Държавното обществено осигуряване (ДОО);
                </li>
                <li>
                  Изчисляване на краен срок за прехвърляне на натрупаните
                  средства за втора пенсия на лицето от Универсален пенсионен
                  фонд (УПФ) към ДОО;
                </li>
                <li>Изчисляване на прогнозен размер на втора пенсия от УПФ;</li>
                <li>
                  Сравнение с цел определяне дали за лицето е по-благоприятно да
                  избере две пенсии – държавна пенсия в намален размер от ДОО
                  плюс втора пенсия от УПФ, или само една пенсия – държавна
                  пенсия в пълен размер от ДОО.{" "}
                </li>
              </ul>

              <p>
                Сайтът предоставя и връзки към относимите към размера на
                пенсията страници на НОИ, НАП и някои от пенсионните компании в
                Република България.
              </p>

              <p>
                Въведените данни не се използват или прехвърлят за цели, които
                не са свързани с основната функционалност на сайта, както и не
                се използват или прехвърлят с цел оценка на кредитоспособността
                или с цел кредитиране.
              </p>

              <div className="border border-black p-2">
                <p>
                  Личните данни, предоставяни от лицата, във връзка с
                  предоставяните от сайта услуги, не се използват за профилиране
                  и директен маркетинг. Същите се използват по време и за
                  нуждите на предоставяната услуга и не се пазят след като
                  ползването на сайта приключи.
                </p>

                <p>
                  Лични данни на лицата, ползващи услугата, не се обработват за
                  целите на директен маркетинг. По преценка на ползващото сайта
                  лице, същото има право по всяко време да получи информация
                  дали и как се пазят личните му данни, и да направи възражение
                  срещу обработване на лични данни, отнасящо се до него, което
                  включва и профилиране, доколкото то е свързано с директния
                  маркетинг.
                </p>

                <p>
                  Всяко лице има право, по всяко време и на основания, свързани
                  с неговата конкретна ситуация, на възражение срещу обработване
                  на лични данни, отнасящи се до него, включително профилиране.
                </p>

                <p>
                  Администраторът е задължен да прекрати обработването на
                  личните данни, освен при наличието на законови основания за
                  обработването, които имат предимство пред интересите, правата
                  и свободите на субекта на данни, или за установяването,
                  упражняването или защитата на правни претенции.
                </p>

                <p>
                  Всяко лице има право да не бъде обект на решение, основаващо
                  се единствено на автоматизирано обработване, включващо
                  профилиране, което поражда правни последствия за него или го
                  засяга в значителна степен и може да поиска човешка намеса от
                  страна на администратора, правото да изрази гледната си точка
                  и да оспори решението. Същото не се прилага, когато:
                </p>

                <ul className="space-y-2 pl-5 cyrillic-list">
                  <li>
                    е необходимо за сключването или изпълнението на договор
                    между лицето и администратор;
                  </li>
                  <li>е разрешено от закона;</li>
                  <li>се основава на изричното съгласие на лицето</li>
                </ul>
              </div>
              <p>
                Администраторът декларира, че е запознат с текста на Общия
                регламент за защита на личните данни и българското
                законодателство, и спазва принципите, установени в тях и правата
                на субектите на личните данни.{" "}
              </p>

              <p className="font-medium">Определения</p>

              <p>
                <span className="font-semibold">„Администратор“</span> на лични
                данни е физическо или юридическо лице, публичен орган, агенция
                или друга структура, която сама или съвместно с други определя
                целите и средствата за обработването на лични данни; когато
                целите и средствата за това обработване се определят от правото
                на ЕС или правото на държава членка, администраторът или
                специалните критерии за неговото определяне могат да бъдат
                установени в правото на ЕС или в правото на държава членка.
              </p>

              <p>
                <span className="font-semibold">„Обработващ лични данни“</span>{" "}
                означава физическо или юридическо лице, публичен орган, агенция
                или друга структура, която обработва лични данни от името на
                администратора.
              </p>

              <p>
                <span className="font-semibold">
                  „Обработване на лични данни“
                </span>{" "}
                е всяка операция или съвкупност от операции, извършвана с лични
                данни или набор от лични данни чрез автоматични или други
                средства като събиране, записване, организиране, структуриране,
                съхранение, адаптиране или промяна, извличане, консултиране,
                употреба, разкриване чрез предаване, разпространяване или друг
                начин, по който данните стават достъпни, подреждане или
                комбиниране, ограничаване, изтриване или унищожаване.
              </p>

              <p>
                <span className="font-semibold">
                  „Съгласие на субекта на данните“
                </span>{" "}
                означава всяко свободно изразено, конкретно, информирано и
                недвусмислено указание за волята на субекта на данните,
                посредством изявление или ясно потвърждаващо действие, което
                изразява съгласието му свързаните с него лични данни да бъдат
                обработени.
              </p>

              <p>
                <span className="font-semibold">„Лични данни“</span> означава
                всяка информация, свързана с идентифицирано физическо лице или
                физическо лице, което може да бъде идентифицирано („субект на
                данни“); физическо лице, което може да бъде идентифицирано, е
                лице, което може да бъде идентифицирано, пряко или непряко,
                по-специално чрез идентификатор като име, идентификационен
                номер, данни за местонахождение, онлайн идентификатор или по
                един или повече признаци, специфични за физическата,
                физиологичната, генетичната, психическата, умствената,
                икономическата, културната или социална идентичност на това
                физическо лице.
              </p>

              <p>
                <span className="font-semibold">„Договорни цели“</span> означава
                целите за обработка на лични данни, посочени в настоящите общи
                условия.
              </p>

              <p>
                С настоящите общи условия администраторът на лични данни
                определя целите и средствата за обработка на личните данни,
                както следва:
              </p>

              <p className="font-medium">
                Използване на лични данни във връзка с използването на
                сайта{" "}
              </p>

              <p>
                Когато лицето използва уеб сайта за събиране на обща информация,
                не е необходимо да въвежда никакви лични данни. Данните, които
                се събират и използват в тази връзка, са ограничени до данните,
                които интернет браузърът на клиента предава автоматично, като
                например датата и часа на запитването в уеб страниците, типа на
                браузъра, настройките на браузъра и IP адреса. Тези данни се
                събират по начин, който не допуска връзка с клиента и единствено
                гарантира възможността за достъп до избраните от него уеб
                страници. IP адресът се съхранява само за времето на посещението
                на страницата. Не се извършва оценка или анализ на лични данни.
              </p>
              <p>
                Сайтът събира, обработва и използва само и единствено следните
                лични данни:
              </p>

              <ul className="space-y-2 pl-5 list-disc">
                <li>Дата на раждане;</li>

                <li>Пол;</li>
                <li>Осигурителен стаж (в години и месеци);</li>
                <li>Натрупана сума по пенсионна партида в УПФ;</li>
                <li>
                  Прогнозен размер на пенсия от ДОО (в пълен и намален размер);
                </li>
              </ul>

              <p>
                само когато това е необходимо, за да се персонализира услугата
                на сайта за ползващото лице и да се обработи поръчката му във
                връзка с предлаганата онлайн услуга и за срока на предоставяната
                услуга. След прекратяване ползването на сайта, въведените лични
                данни се изтриват от системата.
              </p>

              <p>
                Сайтът предоставя директни връзки до уеб страниците на държавни
                институции като Пенсионен калкулатор на НОИ, Издаване на
                удостоверение за персонален идентификационен код (ПИК) за
                електронна идентификация на НОИ, Издаване на Персонален
                идентификационен код (ПИК) на НОИ по електронен път чрез
                Евротръст, Предоставяне на справка за данни от партида по
                Допълнително задължително пенсионно осигуряване (ДЗПО) на НАП,
                както и до страниците на някои от пенсионните компании, работещи
                в Република България. Връзките препращат към съответните
                страници и въведените в тях лични данни и пароли за достъп, не
                се отразяват в системата ни, не се пазят от нея, нито се събират
                или пазят статистически данни за използването на връзките.
              </p>

              <p>
                В случай, че лицето, ползващо сайта, поиска допълнителна
                информация или лично влезне в контакт със служители на
                MoyataPensia.bg, администраторът и обработващ лични данни може
                да запази и поддържа запис от кореспонденцията, както и да
                включи информацията, която съдържа в базата си данни, която се
                поддържа в съответствие с изискванията на Общия регламент за
                защита на данните и Закона за защита на личните данни.
              </p>

              <p className="font-medium">
                Информация за съхранени данни / изтриване на данни
              </p>
              <p>
                Клиентът може да актуализира, коригира, блокира или поиска
                заличаването на личните си данни, ако това не нарушава законово
                изискване.
              </p>
              <p>
                Клиентът може да поиска информация за обема, естеството, целта и
                произхода на събраните лични данни по всяко време. Исканата
                информация се предоставя безплатно в едномесечен срок на адреса,
                посочен в края на настоящите правила за защита на личните данни.
              </p>
              <p>
                Уебсайтът не използва Google Анализ или аналогична услуга, и не
                използва "бисквитки", текстови файлове, които се съхраняват на
                компютъра на клиента и позволяват анализ как се използва
                уебсайта. Не се прави анализ и оценка на използването на
                уебсайта, съставят отчети за дейността на уебсайта и за
                предоставяните услуги. В случай, че търсачка в мрежата,
                инсталира бисквитки, свързано с търсенето на уебсайта,
                инсталирането на "бисквитки" може да се предотврати като се
                зададат съответните настройки на браузъра; в този случай всички
                функции на сайта ще бъдат достъпни в пълнота.
              </p>
              <p className="font-medium">Срок на съхранение</p>
              <p>
                Личните данни, предоставени ни чрез настоящия уеб сайт, ще бъдат
                съхранявани само, докато е необходимо да се изпълнят целите, за
                които са предоставени. Личните данни могат да бъдат съхранявани
                за по- дълъг срок, когато за това има законово основание и при
                съответствие с всички законови периоди на съхранение, приложими
                за тях.
              </p>

              <p className="font-medium">Сигурност на данните</p>
              <p>
                <span>MoyataPensia.bg</span> прилага
                подходящи технически и организационни мерки за защита на личните
                данни срещу неразрешено или незаконно обработване и срещу
                случайна загуба, унищожаване, повреда, промяна или разкриване
                като техническото оборудване, включително преносимо оборудване,
                се съхранява в заключващи се зони, когато е без надзор; не се
                оставя преносимо оборудване, съдържащо лични данни без надзор;
                служителите от персонала на администратора използват подходящи
                сигурни пароли за влизане в системи или бази данни, съдържащи
                лични данни; достъпа до съответните бази данни и системи е
                ограничен до служители и подизпълнители; провеждане на редовна
                оценка на риска и/или тестване за проникване в системите;
                служителите, работещи с лични данни, са осведомени за техните
                отговорности по отношение на обработката на лични данни.
              </p>

              <p>
                При съмнения за нарушени права, свързани с администрирането и
                обработването на лични данни от{" "}
                <span>MoyataPensia.bg</span>, клиентът
                има право да сезира Комисията по защита на личните данни.
              </p>

              <p className="font-medium">Връзка с нас</p>
              <p>
                Моля, свържете се с нас на ел. адрес, посочен по-долу, ако имате
                въпроси или искания, свързани със състоянието на съхранените ви
                лични данни:{" "}
                <span className="font-semibold">moyatapensia@mail.bg</span>
              </p>
            </div>
          </div>
        </div>
      </main>

      <footer className="mt-auto py-3 border-t border-primary/20 bg-secondary/50 text-center text-xs text-muted-foreground">
        <div className="container">
          <p className="text-primary/80">
            © {new Date().getFullYear()} Моята пенсия. Всички права запазени.
          </p>
        </div>
      </footer>
    </div>
  );
};

export default PrivacyPolicy;
